function Numbers(number) {
    let arr = (number.split(" "));

    let hundreds = ["сто","двести","триста","четыреста","пятьсот","шестьсот","семьсот","восемьсот","девятьсот"];
    let tens = ["десять","двадцать","тридцать","сорок","пятьдесят","шестьдесят","семьдесят","восемьдесят","девяносто"];
    let numbers = ["один","два","три","четыре","пять","шесть","семь","восемь","девять"];
    let tenToTwenty = ["одиннадцать","двенадцать","тринадцать","четырнадцать","пятнадцать","шестнадцать","семнадцать","восемнадцать","девятнадцать"];


    let num = [0, 0, 0];

    for (let i = 0; i < 3; i++) {
        let numStr = arr[i];

        for (let j = 0; j < 9; j++) {

            if (numStr == hundreds[j])
                num[0] = ((j+1) * 100);

            if (numStr == tenToTwenty[j])
                num[1] = ((j+1) + 10);

            if (numStr == tens[j])
                num[1] = ((j+1) * 10);

            if (numStr == numbers[j])
                num[2] = (j+1);
        }
    }
    let result = num[0] + num[1] + num[2];
    return (result);
}